In [1]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({
    "city":['new york','chicago','orlando'],
    "temperature": [21,14,35]
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [5]:
df2 = pd.DataFrame({
    "city":['chicago','new york','orlando'],
    "humidity": [65,68,75]
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [7]:
df3 = pd.merge(df1,df2,on = 'city')

In [8]:
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [9]:
df4 = pd.DataFrame({
    "city":['new york','chicago','orlando','baltimore'],
    "temperature": [21,14,35,32]
})
df4

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           32

In [10]:
df5 = pd.DataFrame({
    "city":['chicago','new york','orlando','san fransico'],
    "humidity": [65,68,75,71]
})
df5

           city  humidity
0       chicago        65
1      new york        68
2       orlando        75
3  san fransico        71

In [13]:
# In this merge will happen only thing which are common all there will 
# details will not come in this 
# INNER JOIN IS HAPPENING
df6  = pd.merge(df4,df5,on = 'city')
df6

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [14]:
#Outer means doing outer join means it will consider all the data 
# and where the value is not here it will mention NaN
#INNER JOIN is default
df7 = pd.merge(df4,df5,on = 'city',how = 'outer')

In [15]:
df7

           city  temperature  humidity
0      new york         21.0      68.0
1       chicago         14.0      65.0
2       orlando         35.0      75.0
3     baltimore         32.0       NaN
4  san fransico          NaN      71.0

In [16]:
df8 = pd.merge(df4,df5,on = 'city',how = 'left')

In [17]:
df8

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35      75.0
3  baltimore           32       NaN

In [18]:
df9 = pd.merge(df4,df5,on = 'city',how = 'right')

In [19]:
df9

           city  temperature  humidity
0       chicago         14.0        65
1      new york         21.0        68
2       orlando         35.0        75
3  san fransico          NaN        71

In [22]:
#In this we Don't know from which table the data is coming
# so to check we add indicator
df10 = pd.merge(df4,df5,on = 'city',how = 'outer',indicator=True)
df10

           city  temperature  humidity      _merge
0      new york         21.0      68.0        both
1       chicago         14.0      65.0        both
2       orlando         35.0      75.0        both
3     baltimore         32.0       NaN   left_only
4  san fransico          NaN      71.0  right_only

In [23]:
df11 = pd.DataFrame({
    "city":['new york','chicago','orlando'],
    "temperature": [21,14,35],
    'humidity':[65,68,71]
})
df11

       city  temperature  humidity
0  new york           21        65
1   chicago           14        68
2   orlando           35        71

In [27]:
df12 = pd.DataFrame({
    "city":['new york','chicago','orlando','Seattle'],
    "temperature": [21,14,38,45],
    'humidity':[65,68,71,76]
})
df12

       city  temperature  humidity
0  new york           21        65
1   chicago           14        68
2   orlando           38        71
3   Seattle           45        76

In [28]:
df13 = pd.merge(df11,df12,on = 'city')

In [29]:
#In this it will show data from the both the 
#table as it as data which little different 
df13

       city  temperature_x  humidity_x  temperature_y  humidity_y
0  new york             21          65             21          65
1   chicago             14          68             14          68
2   orlando             35          71             38          71